Revit 2026 API

# AssetSet Class

---

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.VisualAssetSet

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetSet : APIObject, IEnumerable
```
```vb
Public Class AssetSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class AssetSet : public APIObject,
	IEnumerable
```
```fsharp
type AssetSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The AssetSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssetSet | Initializes a new instance of the AssetSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty |  |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Size |  |

|  | Name | Description |
| --- | --- | --- |
|  | Clear |  |
|  | Contains |  |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Erase |  |
|  | ForwardIterator |  |
|  | GetEnumerator |  |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Insert |  |
|  | ReverseIterator |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Visual Namespace